""" 生成器 Generator"""

'''一、概念简答题'''
# yield 和 return 的核心区别是什么？
'''
(1)return：函数执行到 return 立即结束，返回结果，函数内的状态全部销毁。
(2)yield：遇到 yield 会暂停函数执行，返回值给调用者，同时保存当前所有变量状态；
下次调用 next() 时从暂停位置继续执行。

(3)一个函数可以有多个 yield，但 return 执行一次函数就结束。

'''

# 生成器为什么能节省内存？它的执行特点是什么？
'''
生成器是特殊的迭代器，同样是惰性求值：
不会一次性生成所有结果，每次 next() 只计算生成一个值
几乎不占用内存。适合处理超大文件、无限序列等场景
'''

# 生成器表达式和列表推导式在写法、效果上有什么区别？
'''
写法：列表推导式用 []，生成器表达式用 ()。
效果：列表推导式立即生成所有元素，返回列表，占内存；生成器表达式返回生成器对象，惰性计算，省内存。
示例：
li = [i for i in range(10)]   # 列表，立即生成
gen = (i for i in range(10)) # 生成器，惰性计算


比喻：
列表推导式：放上蒸笼后，一次性把所有包子全部蒸好，摆满整个蒸笼
生成器表达式：只准备好了蒸包子的工序，蒸笼里空空如也；
有人来要包子，才现场蒸一个递出去；包子拿走就没了，无法重复拿到
'''

'''二、代码输出题
按执行顺序写出所有打印内容'''
def gen_demo():
    print("第一步")
    yield 1
    print("第二步")
    yield 2
    print("第三步")
    yield 3

g = gen_demo()
print("调用函数后")
print(next(g))
print("---分隔线---")
print(next(g))
# 调用函数后
# 第一步
# 1
# ---分隔线---
# 第二步
# 2

'''三、编程实操题
用生成器实现斐波那契数列，调用 next() 时依次返回下一个斐波那契数
序列规则：1, 1, 2, 3, 5, 8...'''
def fib_generator():
    a,b=1,1
    while True:
        yield a
        a,b=b,a+b

# 测试
fib = fib_generator()
print(next(fib)) # 1
print(next(fib)) # 1
print(next(fib)) # 2
print(next(fib)) # 3

'''
fib = fib_generator()：雇好厨师，还没开始做包子
next()：喊厨师出包子
yield a：把当前做好的包子递出来，厨师原地停下等待下一次指令
再次 next，厨师才继续算下一个数字（制作下一个包子）

总结详见 08可迭代对象,迭代器,生成器.py

补充：
生成器只能迭代一次，元素取出后就销毁；
转为列表后数据保存在内存，可以多次遍历
'''
















