"""一、概念简答题"""
# 1、分别解释什么是可迭代对象（Iterable）、迭代器（Iterator），二者的区别与关系是什么？
'''
(1)可迭代对象（Iterable）：
实现了 __iter__() 方法的对象，可被 for 循环遍历，
例如 list、tuple、str、dict

(2)迭代器（Iterator）：
同时实现了 __iter__() 和 __next__() 方法的对象，是一个可以逐个取值的数据流。

(3)关系：可迭代对象调用 iter() 会返回迭代器；
迭代器一定是可迭代对象，可迭代对象不一定是迭代器

(4)总结
如果对象拥有__iter()__，是可迭代对象
如果对象拥有__iter()__和__next__()方法，则为迭代器对象

(5)比喻
可迭代对象像一本菜单，里面存储了许多内容，菜单本身静静摆在那里
迭代器像一个被菜单召唤出来的服务员
通过 iter(菜单) 召唤服务员，服务员拿着菜单，调用next()，就会报出下一道菜
'''


# 2、内置函数 iter() 和 next() 分别有什么作用？
'''
iter(可迭代对象)：调用对象的 __iter__() 方法，返回对应的迭代器。
next(迭代器)：调用迭代器的 __next__() 方法，返回下一个元素；遍历完毕后抛出 StopIteration 异常
'''

# 3、为什么迭代器相比列表更节省内存？核心原理是什么？
'''
迭代器是惰性求值：
不会一次性生成所有数据存入内存，只有调用 next() 时才会计算并返回当前元素，用完即丢弃。
列表会把所有元素全部加载到内存中，数据量越大，内存差距越明显
'''


"""
二、代码输出题
写出下面代码的运行结果，若报错请说明原因
"""

li = [1, 2, 3]
it = iter(li)
print(next(it)) #1
print(next(it)) #2
print(next(it)) #3
# print(next(it)) #报错：StopIteration


"""
三、特性判断题
写出两次打印的结果，并解释核心原因
"""
it = iter([1, 2, 3])
print("第一次遍历：", list(it)) #第一次遍历： [1, 2, 3]
print("第二次遍历：", list(it)) #第二次遍历： []

"""
iter([1,2,3])：根据列表生成迭代器 it
list(it): 持续不断调用 next(it)，把迭代器里所有剩余元素全部取出来，组装成一个新列表返回
同理，如果是tuple(it)则生成元组

第二次遍历为空的原因：
迭代器是单向、一次性消耗品
元素取出一个少一个，取完就没了，不能自动重置
"""