### 深浅拷贝
##1.赋值：会随着原对象一起变
l1 = [1,2,3,4]
print(l1)#[1, 2, 3, 4]
l2 = l1
print(l2)#[1, 2, 3, 4]
#给li列表新增元素
l1.append(5)
print("新增后l1:",l1)
print("l1内存地址:",id(l1))#l1内存地址: 2075772889408
#新增后l1: [1, 2, 3, 4, 5]
print("新增后l2:",l2)
print("l2内存地址:",id(l2))#l2内存地址: 2075772889408
#新增后l2: [1, 2, 3, 4, 5]
#内存地址相同，完全共享资源，一个值的改变会被另一个完全共享

##2.浅拷贝：数据半共享
#解释：会创建新的对象，拷贝第一层的数据，嵌套层会指向原来的内存地址
# 导入copy 模块
import copy
li1 = [1,2,3,[3,5,4]]
li2 = copy.copy(li1)
print(f'li1:{li1},内存地址:{id(li1)}')
#li1:[1, 2, 3, [3, 5, 4]],内存地址:1880556587712
print(f'li2:{li2},内存地址:{id(li2)}')
#li2:[1, 2, 3, [3, 5, 4]],内存地址:1880556722688
#内存地址不一样，说明不是同一个对象
li1.append(6)
print(f'li1:{li1}\tli2:{li2}')
#li1:[1, 2, 3, [3, 5, 4], 6]	li2:[1, 2, 3, [3, 5, 4]]

#往嵌套列表中[3,5,4]添加元素
print(li1[3])
li1[3].append(7)
print(f'li1[3]:{li1[3]}\tli2[3]:{li2[3]}')
#li1[3]:[3, 5, 4, 7]	li2[3]:[3, 5, 4, 7]
print(f'li1[3]内存地址:{id(li1[3])}\nli2[3]内存地址:{id(li2[3])}')
#li1[3]内存地址:2372809257280
#li2[3]内存地址:2372809257280
#回到上面的解释，外层的内存地址不同，但是内层的内存地址相同

#优点：使用最多的拷贝，拷贝速度快，占用空间小，拷贝效率高

##3.深拷贝：数据完全不共享
#外层的对象和内部的元素都拷贝了一遍
import copy
li1 = [1,2,3,[3,5,4]]
li2 = copy.deepcopy(li1)
print(li1[3])
li1[3].append(9)
print(f'li1[3]:{li1[3]}\tli2[3]:{li2[3]}')
#li1[3]:[3, 5, 4, 9]	li2[3]:[3, 5, 4]
print(f'li1[3]内存地址:{id(li1[3])}\nli2[3]内存地址:{id(li2[3])}')
# li1[3]内存地址:2813496720704
# li2[3]内存地址:2813496720832

#深拷贝数据变化只影响自己本身，跟原来的对象没有关联

###可变对象
#含义：变量对于的值可以修改，但是内存地址不会发生改变

##常见可变类型：list,dict,set
li = [4,5,6,7]
print("li的原来内存地址：",id(li))
#li的原来内存地址： 2804219649408
li.append(2)
print("li的现在内存地址：",id(li))
#li的现在内存地址： 2804219649408

#内存地址没有改变，字典，集合同理
#无论是使用append(),remove()等都一样

##常见不可变类型：int,bool,float,complex,str,tuple
#含义：变量对应的值不能修改，如果修改则会生成一个新的值并分配新的内存空间

n = 10
print("n原内存地址：",id(n))#n原内存地址： 140727335920840
n = 11
print("n现内存地址：",id(n))#n现内存地址： 140727335920872

st = 'zcj'
print(id(st))#1747267371776
st = 'zcjj'
print(id(st))#1747267372064

#对于元组，不支持修改增删
tua = (1,23,4)
print(id(tua))#2250975708288
tua = ('a','f','2')
print(id(tua))#2250975709440

# 注意：前面所说的深浅拷贝只针对可变对象，不可变对象没有拷贝的说法




